// Разработать класс THashStorage (в файле HashStorage.js) для хранения в хэше произвольных пар ключ-значение.
// Ключ может быть любой строкой; значение может иметь любой тип, в том числе векторный (хэш, массив и т.д.)
// Класс должен иметь следующий интерфейс (т.е. иметь следующие публичные методы):
// AddValue(Key,Value) — сохраняет указанное значение под указанным ключом;
// GetValue(Key) — возвращает значение по указанному ключу либо undefined;
// DeleteValue(Key) — удаляет значение с указанным ключом, возвращает true если значение 
// было удалено и false если такого значения не было в хранилище;
// GetKeys() — возвращает массив, состоящий из одних ключей.
// Класс не должен использовать никаких глобальных переменных, не должен «пачкать экран».
// Класс должен быть универсальным, т.е. не зависеть ни от структуры хранимых данных, ни от способа их 
// последующего использования (в т.ч. не должен содержать никаких ссылок на DOM, 
// т.к. может использоваться и вообще без веб-страницы).
// 2.
// Создать объект DrinkStorage класса THashStorage для хранения рецептов напитков.
// Ключом является название напитка; значением — информация о напитке (алкогольный напиток или нет, 
// строка с рецептом приготовления и т.д. по желанию).
// 3.
// Разработать веб-страницу для работы с хранилищем рецептов напитков.
// На странице должно быть информационное окно (div) и кнопки:
// «ввод информации о напитке» — последовательно спрашивает название напитка, алкогольный он или нет, рецепт его 
// приготовления; сохраняет информацию о напитке в хранилище.
// «получение информации о напитке» — спрашивает название напитка и выдаёт в информационное окно либо информацию 
// о нём (по примеру, приведённому ниже), либо сообщение об отсутствии такого напитка в хранилище.
// «удаление информации о напитке» — спрашивает название напитка и удаляет его из хранилища (если он там есть) с 
// выдачей соответствующего сообщения в информационное окно.
// «перечень всех напитков» — выдаёт в информационное окно перечень всех напитков из хранилища (только названия).

// Пример информации о напитке:

// напиток Маргарита
// алкогольный: да
// рецепт приготовления:
// продукт, продукт... смешать...



'use strict';
class HashStorage {
  constructor() {
    this.store_ = {}; // хранилище для значений
  }

  add(key, value) {
    this.store_[key] = value; // сохраняем значение в store
  }

  getValue(key) {
    return this.store_[key]; 
  }

  deleteValue(key) {
    if (this.store_[key] && this.store_[key].length) {
      this.store_[key] = {};
      return true;
    } else {
      return false;
    }
  }

  getKeys() {
    return Object.keys(this.store_);
  }

  
}

const coctailsStorage = new HashStorage();

// Описываем кнопки и пытаемся не выйти в окно
const addButton = document.getElementById('add-coctail');
addButton.onclick = function () {
  const coctail = {};

  const names = window.prompt('Введите название коктеля');
  const isAlcohol = window.confirm('Напиток алкогольный?');
  
  
  // Добавляем значение
  coctailsStorage.add(names, {names, isAlcohol});
  console.log('Coctail was added', coctailsStorage.getValue(names));
};

const remButton = document.getElementById('delete-coctail');

remButton.onclick = function () {
  var r = prompt('Значение');
  // И как вашу мать мне найти это значение

  console.log(coctailsStorage.getKeys().deleteValue([r]));
};